
## Introduction
Using this Python notebook we will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

Steps: 
- Download Dataset from the <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>
- Load the csv file to the spacex database (Using Table import wizard in MySQL)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql
%sql mysql+pymysql://root:<your password>@localhost/spacex

In [2]:
%sql describe spacex

 * mysql+pymysql://root:***@localhost/spacex
10 rows affected.

[('Date', 'date', 'YES', '', None, ''),
 ('Time (UTC)', 'text', 'YES', '', None, ''),
 ('Booster_Version', 'text', 'YES', '', None, ''),
 ('Launch_Site', 'text', 'YES', '', None, ''),
 ('Payload', 'text', 'YES', '', None, ''),
 ('PAYLOAD_MASS__KG_', 'int', 'YES', '', None, ''),
 ('Orbit', 'text', 'YES', '', None, ''),
 ('Customer', 'text', 'YES', '', None, ''),
 ('Mission_Outcome', 'text', 'YES', '', None, ''),
 ('Landing _Outcome', 'text', 'YES', '', None, '')]

In [ ]:
%sql  select * from spacex limit 10

 * mysql+pymysql://root:***@localhost/spacex
10 rows affected.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-09-29', '16:00:00', 'F9 v1.1  B1003', 'VAFB SLC-4E', 'CASSIOPE', 500, 'Polar LEO', 'MDA', 'Success', 'Uncontrolled (ocean)'),
 ('2013-12-03', '22:41:00', 'F9 v1.1', 'CCAFS LC-40', 'SES-8', 3170, 'GTO', 'SES', 'Success', 'No attempt'),
 ('2014-01-06', '22:06:00', 'F9 v1.1', 'CCAFS LC-40', 'Thaicom 6', 3325, 'GTO', 'Thaicom', 'Success', 'No attempt'),
 ('2014-04-18', '19:25:00', 'F9 v1.1', 'CCAFS LC-40', 'SpaceX CRS-3', 2296, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Controlled (ocean)'),
 ('2014-07-14', '15:15:00', 'F9 v1.1', 'CCAFS LC-40', 'OG2 Mission 1  6 Orbcomm-OG2 satellites', 1316, 'LEO', 'Orbcomm', 'Success', 'Controlled (ocean)')]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [ ]:
%sql select distinct("Launch_Site") from spacex as Unique_Launch_Site

 * mysql+pymysql://root:***@localhost/spacex
4 rows affected.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [ ]:
%sql SELECT * FROM spacex WHERE Launch_Site LIKE 'CCA%' limit 5

 * mysql+pymysql://root:***@localhost/spacex
5 rows affected.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [ ]:
%sql select PAYLOAD_MASS__KG_	from spacex where Customer = 'NASA (CRS)'

 * mysql+pymysql://root:***@localhost/spacex
20 rows affected.

[(500,),
 (677,),
 (2296,),
 (2216,),
 (2395,),
 (1898,),
 (1952,),
 (3136,),
 (2257,),
 (2490,),
 (2708,),
 (3310,),
 (2205,),
 (2647,),
 (2697,),
 (2500,),
 (2495,),
 (2268,),
 (1977,),
 (2972,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [ ]:
%sql select avg(PAYLOAD_MASS__KG_) from spacex where Booster_Version = 'F9 v1.1'

 * mysql+pymysql://root:***@localhost/spacex
1 rows affected.

[(Decimal('2928.4000'),)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [ ]:
%sql select min(Date) from spacex where `Landing _Outcome` = 'Success (ground pad)'

 * mysql+pymysql://root:***@localhost/spacex
1 rows affected.

[(datetime.date(2015, 12, 22),)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [ ]:

%sql SELECT Booster_Version FROM spacex WHERE `Landing _Outcome` = 'Success (drone ship)' AND PAYLOAD_MASS__KG_ > 4000 AND PAYLOAD_MASS__KG_ < 6000;

 * mysql+pymysql://root:***@localhost/spacex
4 rows affected.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [ ]:
# List the total number of successful and failure mission outcomes
%sql SELECT Mission_Outcome, COUNT(*) AS num_missions FROM spacex WHERE Mission_Outcome IN ('Success', 'Failure (in flight)') GROUP BY Mission_Outcome;

 * mysql+pymysql://root:***@localhost/spacex
2 rows affected.

[('Success', 98), ('Failure (in flight)', 1)]

### Task 8



##### List the  names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [ ]:
%sql SELECT Booster_Version FROM spacex WHERE PAYLOAD_MASS__KG_ = ( SELECT MAX(PAYLOAD_MASS__KG_) FROM spacex )

 * mysql+pymysql://root:***@localhost/spacex
12 rows affected.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [ ]:
%sql select month(Date), Booster_Version, Launch_Site, `Landing _Outcome` from spacex where `Landing _Outcome` like 'Failure%';

 * mysql+pymysql://root:***@localhost/spacex
10 rows affected.

[(6, 'F9 v1.0  B0003', 'CCAFS LC-40', 'Failure (parachute)'),
 (12, 'F9 v1.0  B0004', 'CCAFS LC-40', 'Failure (parachute)'),
 (1, 'F9 v1.1 B1012', 'CCAFS LC-40', 'Failure (drone ship)'),
 (4, 'F9 v1.1 B1015', 'CCAFS LC-40', 'Failure (drone ship)'),
 (1, 'F9 v1.1 B1017', 'VAFB SLC-4E', 'Failure (drone ship)'),
 (3, 'F9 FT B1020', 'CCAFS LC-40', 'Failure (drone ship)'),
 (6, 'F9 FT B1024', 'CCAFS LC-40', 'Failure (drone ship)'),
 (12, 'F9 B5B1050', 'CCAFS SLC-40', 'Failure'),
 (2, 'F9 B5 B1056.4', 'CCAFS SLC-40', 'Failure'),
 (3, 'F9 B5 B1048.5', 'KSC LC-39A', 'Failure')]

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [ ]:
%sql select count(*) from spacex where `Landing _Outcome` like 'Success%' and Date between '2010-06-04' and '2017-03-20'

 * mysql+pymysql://root:***@localhost/spacex
1 rows affected.

[(8,)]